Revit 2027 API
BuiltInFailures.ConnectorFailures.FittingMustBeOnPipe Property
 The [Tap] must be attached to pipe.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FittingMustBeOnPipe { get; }
Public Shared ReadOnly Property FittingMustBeOnPipe As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FittingMustBeOnPipe {
	FailureDefinitionId^ get ();
}
static member FittingMustBeOnPipe : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace